tests/reports/load/cluster_server_load.txt
tests  (git)-[main]- ➤ pnpm test:load:local

> tests@1.0.0 test:load:local /Users/subhajitgorai/Codes/current_projects/opencanvas/tests
> artillery run load-test.yml -e local

Test run id: tgdbn_4wgf596q54m7xbmdnxqchnd45yx4j_cpx7
Phase started: Warm up - filling cache (index: 0, duration: 30s) 10:00:31(+0530)

--------------------------------------
Metrics for period to: 10:00:40(+0530) (width: 7.811s)
--------------------------------------

http.codes.200: ................................................................ 80
http.downloaded_bytes: ......................................................... 1096382
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 80
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 16
  mean: ........................................................................ 2.6
  median: ...................................................................... 1
  p95: ......................................................................... 10.1
  p99: ......................................................................... 12.1
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 16
  mean: ........................................................................ 2.6
  median: ...................................................................... 1
  p95: ......................................................................... 10.1
  p99: ......................................................................... 12.1
http.responses: ................................................................ 80
vusers.completed: .............................................................. 80
vusers.created: ................................................................ 80
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 26
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 54
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 41.4
  mean: ........................................................................ 6.5
  median: ...................................................................... 4
  p95: ......................................................................... 17.3
  p99: ......................................................................... 25.3


--------------------------------------
Metrics for period to: 10:00:50(+0530) (width: 9.812s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 1241042
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5
  mean: ........................................................................ 1
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 5
  mean: ........................................................................ 1
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 28
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 72
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.9
  max: ......................................................................... 7.1
  mean: ........................................................................ 2.9
  median: ...................................................................... 2.5
  p95: ......................................................................... 5
  p99: ......................................................................... 6.9


Phase completed: Warm up - filling cache (index: 0, duration: 30s) 10:01:01(+0530)

Phase started: Ramp up - scaling connections (index: 1, duration: 60s) 10:01:01(+0530)

--------------------------------------
Metrics for period to: 10:01:00(+0530) (width: 9.811s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 1148563
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 9
  mean: ........................................................................ 1
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 6
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 9
  mean: ........................................................................ 1
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 6
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 22
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 78
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.9
  max: ......................................................................... 10.7
  mean: ........................................................................ 2.7
  median: ...................................................................... 2.3
  p95: ......................................................................... 4.6
  p99: ......................................................................... 7.3


--------------------------------------
Metrics for period to: 10:01:10(+0530) (width: 9.94s)
--------------------------------------

http.codes.200: ................................................................ 147
http.downloaded_bytes: ......................................................... 1848620
http.request_rate: ............................................................. 16/sec
http.requests: ................................................................. 147
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5
  mean: ........................................................................ 1.2
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 5
  mean: ........................................................................ 1.2
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 147
vusers.completed: .............................................................. 147
vusers.created: ................................................................ 147
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 49
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 98
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.9
  max: ......................................................................... 7.6
  mean: ........................................................................ 3.1
  median: ...................................................................... 2.7
  p95: ......................................................................... 5.2
  p99: ......................................................................... 6.6


--------------------------------------
Metrics for period to: 10:01:20(+0530) (width: 9.92s)
--------------------------------------

http.codes.200: ................................................................ 294
http.downloaded_bytes: ......................................................... 3544413
http.request_rate: ............................................................. 31/sec
http.requests: ................................................................. 294
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 0.9
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 0.9
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 3
http.responses: ................................................................ 294
vusers.completed: .............................................................. 294
vusers.created: ................................................................ 294
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 74
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 220
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.8
  max: ......................................................................... 5.9
  mean: ........................................................................ 2.4
  median: ...................................................................... 2.3
  p95: ......................................................................... 3.4
  p99: ......................................................................... 4.8


--------------------------------------
Metrics for period to: 10:01:30(+0530) (width: 9.972s)
--------------------------------------

http.codes.200: ................................................................ 449
http.downloaded_bytes: ......................................................... 5413602
http.request_rate: ............................................................. 45/sec
http.requests: ................................................................. 449
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.responses: ................................................................ 449
vusers.completed: .............................................................. 449
vusers.created: ................................................................ 449
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 122
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 327
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 5.4
  mean: ........................................................................ 2.2
  median: ...................................................................... 2.2
  p95: ......................................................................... 2.6
  p99: ......................................................................... 4.1


--------------------------------------
Metrics for period to: 10:01:40(+0530) (width: 9.975s)
--------------------------------------

http.codes.200: ................................................................ 599
http.downloaded_bytes: ......................................................... 7156055
http.request_rate: ............................................................. 60/sec
http.requests: ................................................................. 599
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 3
http.responses: ................................................................ 599
vusers.completed: .............................................................. 599
vusers.created: ................................................................ 599
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 163
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 436
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.6
  max: ......................................................................... 5.3
  mean: ........................................................................ 2.1
  median: ...................................................................... 2.1
  p95: ......................................................................... 2.5
  p99: ......................................................................... 4.1


--------------------------------------
Metrics for period to: 10:01:50(+0530) (width: 9.979s)
--------------------------------------

http.codes.200: ................................................................ 753
http.downloaded_bytes: ......................................................... 9085935
http.request_rate: ............................................................. 76/sec
http.requests: ................................................................. 753
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 3
http.responses: ................................................................ 753
vusers.completed: .............................................................. 753
vusers.created: ................................................................ 753
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 201
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 552
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.5
  max: ......................................................................... 5.3
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 2.6
  p99: ......................................................................... 4.3


Phase completed: Ramp up - scaling connections (index: 1, duration: 60s) 10:02:01(+0530)

Phase started: Sudden spike - the viral event (index: 2, duration: 10s) 10:02:01(+0530)

--------------------------------------
Metrics for period to: 10:02:00(+0530) (width: 9.997s)
--------------------------------------

http.codes.200: ................................................................ 904
http.downloaded_bytes: ......................................................... 11400653
http.request_rate: ............................................................. 91/sec
http.requests: ................................................................. 904
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.responses: ................................................................ 904
vusers.completed: .............................................................. 904
vusers.created: ................................................................ 904
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 271
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 633
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.5
  max: ......................................................................... 6
  mean: ........................................................................ 2
  median: ...................................................................... 2
  p95: ......................................................................... 2.4
  p99: ......................................................................... 3.9


Phase completed: Sudden spike - the viral event (index: 2, duration: 10s) 10:02:11(+0530)

--------------------------------------
Metrics for period to: 10:02:10(+0530) (width: 9.986s)
--------------------------------------

http.codes.200: ................................................................ 4307
http.downloaded_bytes: ......................................................... 54539384
http.request_rate: ............................................................. 432/sec
http.requests: ................................................................. 4307
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 5
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.responses: ................................................................ 4307
vusers.completed: .............................................................. 4307
vusers.created: ................................................................ 4307
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 1309
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 2998
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.3
  max: ......................................................................... 7.2
  mean: ........................................................................ 1.9
  median: ...................................................................... 1.8
  p95: ......................................................................... 2.7
  p99: ......................................................................... 3.6


--------------------------------------
Metrics for period to: 10:02:20(+0530) (width: 1.881s)
--------------------------------------

http.codes.200: ................................................................ 867
http.downloaded_bytes: ......................................................... 11042322
http.request_rate: ............................................................. 507/sec
http.requests: ................................................................. 867
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 6
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 6
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 3
http.responses: ................................................................ 867
vusers.completed: .............................................................. 867
vusers.created: ................................................................ 867
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 260
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 607
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.3
  max: ......................................................................... 9.1
  mean: ........................................................................ 1.9
  median: ...................................................................... 1.7
  p95: ......................................................................... 2.7
  p99: ......................................................................... 6.4


All VUs finished. Total time: 1 minute, 42 seconds

--------------------------------
Summary report @ 10:02:14(+0530)
--------------------------------

http.codes.200: ................................................................ 8600
http.downloaded_bytes: ......................................................... 107516971
http.request_rate: ............................................................. 115/sec
http.requests: ................................................................. 8600
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 16
  mean: ........................................................................ 0.8
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 16
  mean: ........................................................................ 0.8
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 3
http.responses: ................................................................ 8600
vusers.completed: .............................................................. 8600
vusers.created: ................................................................ 8600
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 2525
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 6075
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.3
  max: ......................................................................... 41.4
  mean: ........................................................................ 2
  median: ...................................................................... 1.9
  p95: ......................................................................... 3
  p99: ......................................................................... 4.9